
<meta property="og:image" content="https://koshk.ru/koshkbench/img/urlimgs/1171_vk.png" />
<style>
a.kbDlButton {
    /*width: 90%;*/
	margin-bottom:10px;
}
</style>

<!---/HEAD---->

<h3 class='post-title entry-title'>Перевод Minecraft 1.17.1</h3>

<div class='post-body entry-content'>
<img src="/koshkbench/img/covers/1_17_1.png" class="kbImage">

<br><br>
<span class="kbsectionheader">Пакет включает в себя:</span><br>
- перевод меню и названий всех предметов до версии 1.17.1 включительно (полностью совместим с 1.17);<br>
- перевод финального диалога и splash'ей.<br>
<br>
<span class="kbsectionheader">Заметные изменения:</span><br>
- альтернативный перевод всего адского (начиная с того, что Nether здесь - Преисподняя);<br>
- альтернативный перевод нескольких видов мобов (в т.ч. вернулись свинолюди и свинозомби);<br>
- для упрощения поиска и сортировки, теперь всё "из дерева", т.е. вместо "дубовой кнопки" будет "кнопка из дуба";<br>
- включает исправления для некоторых модов.<br>
<br>

<!--<a href="/koshkbench/russifiers/RUS_11604_rureplacer.zip" class="kbDlButton" download><div class="downloadArrow"></div><div class='dl'>Скачать</div>Ресурспак с переводом для Minecraft 1.16.4<br>— заменяет оригинальный русский</a>
<br>— отдельный язык--><a href="/koshkbench/russifiers/1_17/RUS_1_17_1.zip" class="kbDlButton" download><div class="downloadArrow"></div><div class='dl'>Скачать</div>Ресурспак с переводом для Minecraft 1.17.1</a><br>
<br>

<span class="kbsectionheader">Установка:</span><br>
1. Копируем скачанный файл в папку с пакетами ресурсов. Найти эту папку можно из самой игры, перейдя в настройки -> Наборы ресурсов (Resource Packs), и там нажать "Папка с наборами"/"Open Pack Folder".<br>
2. Затем в игре активируем пакет ресурсов "RUS_1_17_1".<br>
3. Выбираем язык "Русский KB".<br>
(4.) Если русификатор не работает или вдруг перестал работать, попробуйте поднять его выше в списке выбранных ресурспаков, пока не заработает.<br>
<br>

<span class="kbsectionheader">Перевод также включает в себя строки для следующих модов*:</span>
<br>Forge
<br>Xaero's Minimap
<br>Xaero's World Map
<br>Better PvP
<br>Comforts
<br>CubesPlus (Cube++)
<br>Decorative Blocks
<br>Extra Boats
<br>Go Prone
<br>Quark
<br>Redstone Gates
<br>Storage Overhaul
<br>Useful Backpacks
<br><span style="font-size: 12px; font-weight: normal; padding-top: 10px;">* наличие строк никак не сказывается на совместимости с чистой игрой или игрой с другими модами</span>
<br>

<br>Также в какой-то момент могут добавиться Absent by Design и Aurum's More Blocks
<br>Если у вас есть предложения модов, или возникли проблемы (например, с русификатором отваливается русский перевод, уже имеющийся в каком-то моде) — пишите мне через форму обратной связи (кнопка внизу страницы).<br>
<br>

<p>Я с радостью прочитаю о найденных вами опечатках или явных ошибках в переводе.<br>
Однако участвовать в спорах о переводе терминов и названий ресурсов я не стану. В этой версии перевода всё переведено так, как я считаю нужным, основываясь на своём опыте игры в Minecraft, а также опыте перевода как его, так и других игр.
<br>Любить или ненавидеть данный перевод — дело за вами. Я же считаю его настолько правильным, насколько я способен сделать на данный момент, и доволен своей работой.
<br>Впрочем, вам никто не запрещает предлагать свои варианты перевода предметов или монстров через форму обратной связи — я не собираюсь <i>спорить</i>, однако я всегда буду рад удивиться и восхититься действительно хорошим вариантом.</p>

</div>

<div class='post-footer'>
<div class='date-header'>Дата публикации: 22 ноября 2020 г.<br>Последнее обновление: 16 октября 2021 г.</div>
<div class="feedbackButton">Написать автору</div>
</div>