
<h3 class='post-title entry-title'>Перевод Minecraft 1.4.7</h3>

<div class='post-body entry-content'>

<span class="kbsectionheader">Русификатор включает в себя:</span><br>
- шрифты, позволяющие писать в чате по-русски;<br>
- перевод меню и названий всех предметов до версии 1.4.7 включительно;<br>
- перевод splash'ей (часть сохранена на англ. или других языках, т.к. не имеют смысла после перевода, например, приветствия на разных языках или строчки песен);<br>
- перевод финального диалога и титров.<br>
<br>
<a href="/koshkbench/russifiers/RUS_1_4_7.zip" class="kbDlButton" download"><div class="downloadArrow"></div><div class='dl'>Скачать</div>Русификатор Minecraft 1.4.7</a><br>
<br>
Русификатор полностью совмести с версиями Minecraft с 1.4.5 по 1.4.7 и далее по Snapshot 13w01b (первый снапшот к 1.5).<br>
Возможны пробелы в переводе в версиях 1.4.2-1.4.4 и частичная или полная несовместимость с ещё более ранними версиями.<br>
<br>
<b><span style="font-size:12pt;">Установка:</span></b><br>
Клиент:</b><br>
1. Открываем папку <b>%AppData%</b> ("Пуск", там вводим в поле поиска или "выполнить" слово %appdata%, и перед нами сразу же откроется папка, содержащая папку .minecraft<br>
(для Win7 это C:\Пользователи\%username%\AppData\Roaming\).<br>
2. Открываем папку <b>bin</b>, в ней находим <b>minecraft.jar</b>, открываем его через Winrar (или аналог, например 7zip).<br>
3. Удаляем из него папку <b>META-INF</b> .<br>
4. Если нужно произвести полную установку данного русификатора, то внутрь <b>minecraft.jar</b> копируем всё сожержимое архива.<br>
Если вы хотите только поставить русский шрифт, чтобы видеть чат и таблички на сервере, то копируем из архива только папку <b>font</b> и файл <b>font.txt</b>.<br>
Если у вас стоит любимый шрифт и вы хотите только изменить перевод, то копируем из архива только папки <b>lang</b> и <b>title</b>.<br><br>

<b>Сервер:</b><br>
Открываем через Winrar ваш <b>minecraft_server.jar</b> (или craftbukkit-1.4.x-Rx.x.jar).<br>
Чтобы писать по-русски на табличках, копируем из архива файл "font.txt".<br>
Чтобы игроки видели серверные надписи из данного русификатора, а не стандартные, копируем из архива папку "lang".<br>
Соответственно, для достижения обеих целей, копируем и font.txt, и папку lang.<br><br>
</div>

<div class='post-footer'>
<div class='date-header'>Дата публикации: 19 января 2013 г.</div>
<div class="feedbackButton">Написать автору</div>
</div>