
<meta property="og:image" content="https://koshk.ru/koshkbench/img/urlimgs/1180_vk.png" />
<style>
a.kbDlButton {
    /*width: 90%;*/
	margin-bottom:10px;
}
</style>

<!---/HEAD---->

<h3 class='post-title entry-title'>Перевод Minecraft 1.18.2</h3>

<div class='post-body entry-content'>
<img src="/koshkbench/img/covers/1_18_lt.png" class="kbImage">

<br><br>
<span class="kbsectionheader">Пакет включает в себя:</span><br>
- перевод меню и названий всех предметов до версии 1.18.2 включительно (на 99% совместим с 1.17);<br>
- перевод финального диалога и splash'ей.<br>
<br>
<span class="kbsectionheader">Заметные изменения:</span><br>
- альтернативный перевод всего адского (начиная с того, что Nether здесь - Преисподняя);<br>
- альтернативный перевод нескольких видов мобов (в т.ч. вернулись свинолюди и свинозомби);<br>
- для упрощения поиска и сортировки, теперь всё «из дерева», т.е. вместо "дубовой кнопки" будет «кнопка из дуба»;<br>
- включает в себя исправления для некоторых модов.<br>
<br>


<!--<a href="/koshkbench/russifiers/RUS_11604_rureplacer.zip" class="kbDlButton" download><div class="downloadArrow"></div><div class='dl'>Скачать</div>Ресурспак с переводом для Minecraft 1.16.4<br>— заменяет оригинальный русский</a>
<br>— отдельный язык--><a href="/koshkbench/russifiers/1_18/RUS_1_18_2.zip" class="kbDlButton" download><div class="downloadArrow"></div><div class='dl'>Скачать</div>Ресурспак с переводом для Minecraft 1.18.2</a><br>
<br>

<span class="kbsectionheader">Установка:</span><br>
1. Копируем скачанный файл в папку с пакетами ресурсов. Найти эту папку можно из самой игры, перейдя в настройки -> Наборы ресурсов (Resource Packs), и там нажать «Папка с наборами» (Open Pack Folder).<br>
2. Затем в игре активируем пакет ресурсов «RUS_1_18_2».<br>
3. Выбираем язык «Русский KB».<br>
(4.) Если перевод не работает или вдруг перестал работать, попробуйте поднять его выше в списке выбранных ресурспаков, пока не заработает.<br>
<br>

<div class="kbspoilerheader kbsectionheader" for="settingsSpoiler">Краткий гайд по настройкам графики</div>
<div class="kbspoiler" id="settingsSpoiler">
Я понимаю, что в настройках графики можно заблудиться, да и кто-то мог уже привыкнуть к старым названиям. Плюс, кто-то может узнать что-то новое. Поэтому расписываю ниже, что за что отвечает. На всякий случай.<br>
<ul>
<li><b>Полноэкранное разрешение</b> — разрешение, действующее при игре во весь экран (F11).</li>
<li><b>Граница биомов</b> — ширина (в блоках) полосы на границе двух биомов, в которой цвет травы и листьев будет смешиваться для более плавного перехода между биомами.</li>
<li><b>Графика</b> — древнейший и первозданно отвратительный переключатель, отвечающий сразу за несколько параметров, самый заметный из которых — прозрачность листьев.</li>
<li><b>Видимость</b> — радиус видимости в чанках. Напрямую влияет на лаги и объём потребляемой оперативной памяти.</li>
<li><b>Радиус процессов</b> — радиус в чанках вокруг игрока, в котором будут выполняться различные расчёты, например, для передвижения мобов, работы механизмов и роста растений. Позволяет снизить лаги при большом радиусе видимости, но создаст эффект «мира на паузе» для отдалённых объектов.</li>
<li><b>Обновление чанков</b> — отвечает за то, будут ли ближайшие к игроку чанки обновляться синхронно (в том же потоке, в котором над ними были произведены изменения).
«Асинхронное» — ближайшие к игроку чанки обновляются в параллельных потоках. Из-за этого после разрушения блока на его месте на короткое время может возникать дыра.
«Полусинхронное» — некоторые действия, в т.ч. разрушение блоков, запустят синхронное обновление изменённого чанка.
«Синхронное» — ближайшие к игроку чанки всегда обновляются синхронно. Это может вызывать притормаживания игры при разрушении/размещении блоков.</li>
<li><b>Сглаженные тени</b> — градиентное сглаживание теней от блока к блоку. Выкл — каждый блок целиком будет иметь свою собственную яркость, без градиентного перехода.</li>
<li><b>Ограничение FPS</b> — ограничение количества кадров. Убирает излишнюю нагрузку на систему, особенно полезно для легко перегревающихся систем (напрмер, ноутбуков).</li>
<li><b>Вертикальная синхронизация</b> — форсирование ожидания подготовки кадра целиком перед его отображением. Убирает «разрывы» изображения, но даже на мощных ПК может создавать излишние лаги в нагруженных эффектами кадрах и вызывать почти постоянный эффект вязкости мыши. Ограничивает максимальное кол-во кадров до частоты обновления вашего монитора.</li>
<li><b>Покачивание камеры</b> — покачивание камеры при ходьбе. На самом деле, практически не влияет на производительность, но по ощущениям делает микротормоза в разы заметнее из-за перескоков камеры.</li>
<li><b>Размер интерфейса</b> — размер интерфейса.</li>
<li><b>Индикатор атаки</b> — расположение индикатора атаки: рядом с прицелом в центре экрана или внизу рядом с индикаторами здоровья.</li>
<li><b>Светлость блоков</b> — параметр, который часто путают с яркостью. Отвечает за дополнительную освещённость блоков сверх обычного. 0 — без дополнительной подсветки, исторически задуманный. До 50 — комфортные значения для более светлого ощущения мира. От 50 до 100 — пересвет, с которым яркость хорошо освещённых блоков не соответствует своему реальному уровню яркости, такие значения полезны при игре с низкой яркостью экрана или при исследовании пещер без освещения.</li>
<li><b>Облака</b> — без облаков, плоская текстура облаков, или 3D-модель облаков.</li>
<li><b>Полноэкранный режим</b> — переключение полноэкранного режима (F11).</li>
<li><b>Частицы</b> — количество отображаемых частиц. При настройке «минимум» не будет отображаться, например, дым от факела.</li>
<li><b>Число MIP-уровней</b> — количество уровней MIP-маппинга, т.е. дополнительных текстур меньшего разрешения, которые используются на больших расстояниях для ликвидации ряби. Влияние на производительность сильно зависит от системы.</li>
<li><b>Тени сущностей</b> — круглые тени под мобами, игроками и выпадающими предметами.</li>
<li><b>Дальность сущностей</b> — дальность прорисовки сущностей (мобов, игроков, предметов).</li>
<li><b>Эффекты искажения</b> — эффекты искажения экрана в порталах, эффект тошноты.</li>
<li><b>Эффекты поля зрения</b> — эффект бега.</li>
</div>
<br>

<div class="kbspoilerheader kbsectionheader" for="modsSpoiler">Перевод также включает в себя строки для следующих модов*:</div>
<div class="kbspoiler" id="modsSpoiler">Forge
<br>Xaero's Minimap
<br>Xaero's World Map
<br>Better PvP
<br>Comforts
<br>CubesPlus (Cube++)
<br>Decorative Blocks
<br>Extra Boats
<br>Go Prone
<br>Quark
<br>Redstone Gates
<br>Storage Overhaul
<br>Useful Backpacks
<br><span style="font-size: 11px; font-weight: normal; padding-top: 10px;">* наличие строк никак не сказывается на совместимости с чистой игрой или игрой с другими модами. Плюс, строки могут быть уже устаревшими. Сообщайте о любых проблемах совместимости.
Также вы можете отправить мне любой мод, чтобы я добавил его перевод в свой пак (для этого воспользуйтесь кнопкой "Написать автору").
</span>
</div>
<br>
<p>Если у вас есть предложения модов, или возникли проблемы (например, с русификатором отваливается русский перевод, уже имеющийся в каком-то моде) — пишите мне через форму обратной связи (кнопка внизу страницы).</p>
<br>
<p>Я с радостью прочитаю о найденных вами опечатках или явных ошибках в переводе.<br>
Однако участвовать в спорах о переводе терминов и названий ресурсов я не стану. В этой версии перевода всё переведено так, как я считаю нужным, основываясь на своём опыте игры в Minecraft, а также опыте перевода как его, так и других игр.</p>
<br>
<p>Любить или ненавидеть данный перевод — дело за вами. Я же считаю его настолько правильным, насколько я способен сделать на данный момент, и доволен своей работой.
<br>Впрочем, вам никто не запрещает предлагать свои варианты перевода предметов или монстров через форму обратной связи — я не собираюсь <i>спорить</i>, однако я всегда буду рад удивиться и восхититься действительно хорошим вариантом.</p>


</div>

<div class='post-footer'>
<div class='date-header'>Дата публикации: 13 ноября 2021 г.<br>Последнее обновление: 7 июня 2022 г.</div>
<div class="feedbackButton">Написать автору</div>
</div>