
<h3 class='post-title entry-title'>Свершилось!</h3>

<div class='post-body entry-content' style="font-size: 1.08rem;">
<p>Я всё же не дотянул до 2021, и koshkbench теперь располагается на <a href="https://koshk.ru/koshkbench/">koshk.ru/koshkbench</a> (и <a href="https://blog.koshk.ru/">blog.koshk.ru</a> отныне перенаправляет сюда).</p>

<p>Обратите внимание, что теперь в блоге нет комментариев. Когда-нибудь я, возможно, это исправлю. А пока что можете писать через форму обратной связи, которую можно открыть с любой страницы данного сайта в конце каждой статьи (где обычно как раз комментарии).</p>

<p>Куда я делся? Зайдите на сам <a href="https://koshk.ru/">koshk.ru</a> и увидите, в чём я участвовал и продолжаю участвовать в свободное время =)</p>

<p>Из моих планов относительно Minecraft: их пока нет, но меня очень огорчило то, как изуродовали перевод в Nether Update. Так что нельзя сказать, что нет повода вернуться с новым русиком.</p>

<p><b>UPD 23.07.2021:</b><br>Комментарии на сайте добавлены, русификаторы 1.16 и 1.17 опубликованы, всё под относительным контролем 👌</p>

</div>

<div class='post-footer'>
<div class='date-header'>Дата публикации: 08 сентября 2020 г.<br>Последнее обновление: 23 июля 2021 г.</div>
<div class="feedbackButton">Написать автору</div>
</div>